Advanced Dataframes Exercises

In [1]:
import pandas as pd
import numpy as np
from pydataset import data

Exercises 1

In [ ]:
#1 and 2 completed in the terminal

In [2]:
#3 - Create a function named get_db_url. 
#It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
from env import host, username, password

get_db_url = f'mysql+pymysql://{username}:{password}@{host}/employees'

In [5]:
#4 - Use your function to obtain a connection to the employees database
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [6]:
#5a -  Intentionally make a typo in the database url. What kind of error message do you see?
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#returns a "name 'url' is not defined" error message

NameError: name 'url' is not defined

In [7]:
#5b - Intentionally make an error in your SQL query. What does the error message look like?
pd.read_sql('SELECT FROM employees LIMIT 5 OFFSET 50', get_db_url)
#returns "you have an error in your sql syntax..." error message

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM employees LIMIT 5 OFFSET 50' at line 1")
[SQL: SELECT FROM employees LIMIT 5 OFFSET 50]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [9]:
#6 Read the employees and titles tables into two separate DataFrames
employees = pd.read_sql('SELECT * FROM employees', get_db_url)
titles = pd.read_sql('SELECT * FROM titles', get_db_url)

In [10]:
#7 - How many rows and columns do you have in each DataFrame?
employees.shape
#300024 rows and 6 columns

(300024, 6)

In [11]:
#7
titles.shape
#443308 rows and 4 columns

(443308, 4)

In [12]:
#8 - Display the summary statistics for each DataFrame.
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [13]:
#8
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [20]:
#9 - How many unique titles are in the titles DataFrame?
titles.nunique()
#there are 7 unique titles

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [32]:
#10 - What is the oldest date in the to_date column?
titles.sort_values(by='to_date').head(1)
#returns a to_date of '1985-03-01'

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [34]:
#11 - What is the most recent date in the to_date column?
titles.sort_values(by='to_date', ascending=False).head(1)
#returns a to_date of '9999-01-01'

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01

Exercises 2

In [3]:
#1 - Copy the users and roles DataFrames from the examples above.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [4]:
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [5]:
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [11]:
#2 - What is the result of using a right join on the DataFrames?
users.merge(roles, how='right')

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

In [10]:
#adding the left_on and right_on keys includes the role_id, id, and the role that no one is assigned to
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [12]:
#3 - What is the result of using an outer join on the DataFrames?
users.merge(roles, how='outer')

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

In [13]:
#including the right_on and left_on keys returns:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [4]:
#4 - What happens if you drop the foreign keys from the DataFrames and try to merge them?
fkey_drop = users.drop(columns='role_id')

In [5]:
#the merge now incorrectly matches the data in the columns
pd.merge(fkey_drop, roles, on='id')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter

In [3]:
#5 - Load the mpg dataset from PyDataset.
mpg = data('mpg')

In [18]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [19]:
#6 - Output and read the documentation for the mpg dataset
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [5]:
#7 - How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [91]:
#8 - Check out your column names and perform any cleanup you may want on them.
mpg.rename(columns={'hwy': 'highway', 'cty': 'city'})

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,automatic
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,automatic
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,automatic
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,manual
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,automatic
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,manual
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,automatic

In [23]:
#9 - Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [6]:
# can also exclude numeric values with:
mpg.describe(exclude=np.number)

       manufacturer        model     trans  drv   fl class
count           234          234       234  234  234   234
unique           15           38        10    3    5     7
top           dodge  caravan 2wd  auto(l4)    f    r   suv
freq             37           11        83  106  168    62

In [34]:
#10 - How many different manufacturers are there?
#find the unique manufacturers
mpg.manufacturer.unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [7]:
#can also do 
mpg.manufacturer.value_counts()
#which will return a list of unique values and the counts of each

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

In [35]:
#get the length of the series to get a count
len(mpg.manufacturer.unique())

15

In [36]:
#11 - How many different models are there?
mpg.model.unique()

array(['a4', 'a4 quattro', 'a6 quattro', 'c1500 suburban 2wd', 'corvette',
       'k1500 tahoe 4wd', 'malibu', 'caravan 2wd', 'dakota pickup 4wd',
       'durango 4wd', 'ram 1500 pickup 4wd', 'expedition 2wd',
       'explorer 4wd', 'f150 pickup 4wd', 'mustang', 'civic', 'sonata',
       'tiburon', 'grand cherokee 4wd', 'range rover', 'navigator 2wd',
       'mountaineer 4wd', 'altima', 'maxima', 'pathfinder 4wd',
       'grand prix', 'forester awd', 'impreza awd', '4runner 4wd',
       'camry', 'camry solara', 'corolla', 'land cruiser wagon 4wd',
       'toyota tacoma 4wd', 'gti', 'jetta', 'new beetle', 'passat'],
      dtype=object)

In [37]:
#get the length for a count
len(mpg.model.unique())

38

In [10]:
#12 - Create a column named mileage_difference like you did in the DataFrames exercises; 
#this column should contain the difference between highway and city mileage for each car.
mpg['mileage_difference'] = mpg.hwy - mpg.cty

In [40]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [11]:
#13 - Create a column named average_mileage like you did in the DataFrames exercises; 
#this is the mean of the city and highway mileage.
mpg['average_mileage'] = (mpg.cty + mpg.hwy) / 2

In [42]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

In [53]:
#14 - Create a new column on the mpg dataset named is_automatic 
#that holds boolean values denoting whether the car has an automatic transmission.
mpg['is_automatic'] = np.where(mpg.trans.str.startswith('auto'), 'yes', 'no')

In [50]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,yes
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,no
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,no
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,yes
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,yes

In [68]:
# or
mpg['is_automatic'] = np.where(mpg.trans.str.startswith('auto'), 'automatic', 'manual')

In [52]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,automatic
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,automatic
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,automatic

In [55]:
#15 - Using the mpg dataset, 
#find out which which manufacturer has the best miles per gallon on average?
mpg.groupby('manufacturer').average_mileage.describe()
#overall stats info grouped by manufacturer

              count       mean       std   min     25%    50%     75%   max
manufacturer
audi           18.0  22.027778  1.996116  19.5  20.625  21.50  23.375  25.5
chevrolet      19.0  18.447368  3.950720  12.5  15.250  19.00  21.250  26.0
dodge          37.0  15.540541  3.005500  10.5  13.500  15.00  18.000  21.0
ford           25.0  16.680000  2.540833  13.0  15.000  15.50  18.500  22.0
honda           9.0  28.500000  1.984313  25.0  28.000  28.50  30.000  30.5
hyundai        14.0  22.750000  1.794757  20.0  22.000  22.50  23.875  26.0
jeep            8.0  15.562500  2.859040  10.5  14.750  16.00  17.125  19.5
land rover      4.0  14.000000  1.154701  13.0  13.000  14.00  15.000  15.0
lincoln         3.0  14.166667  0.763763  13.5  13.750  14.00  14.500  15.0
mercury         4.0  15.625000  0.478714  15.0  15.375  15.75  16.000  16.0
nissan         13.0  21.346154  4.214976  15.0  17.000  22.00  23.000  27.5
pontiac         5.0  21.700000  0.974679  20.5  21.000  22.00  22.000  23.0
subaru         14.0  22.428571  0.957905  20.5  22.000  22.50  23.375  23.5
toyota         34.0  21.720588  5.059032  13.0  17.500  22.00  25.750  32.5
volkswagen     27.0  25.074074  4.904283  19.5  22.500  25.00  25.000  39.5

In [63]:
#return just manufacturer and average milage
mpg.groupby('manufacturer').average_mileage.mean()

manufacturer
audi          22.027778
chevrolet     18.447368
dodge         15.540541
ford          16.680000
honda         28.500000
hyundai       22.750000
jeep          15.562500
land rover    14.000000
lincoln       14.166667
mercury       15.625000
nissan        21.346154
pontiac       21.700000
subaru        22.428571
toyota        21.720588
volkswagen    25.074074
Name: average_mileage, dtype: float64

In [12]:
#return just manufacturer and average mileage
mpg.groupby('manufacturer').average_mileage.agg(['mean'])

                   mean
manufacturer
audi          22.027778
chevrolet     18.447368
dodge         15.540541
ford          16.680000
honda         28.500000
hyundai       22.750000
jeep          15.562500
land rover    14.000000
lincoln       14.166667
mercury       15.625000
nissan        21.346154
pontiac       21.700000
subaru        22.428571
toyota        21.720588
volkswagen    25.074074

In [14]:
#can also run like this so it can be sorted
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False)

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
toyota        21.720588
pontiac       21.700000
nissan        21.346154
chevrolet     18.447368
ford          16.680000
mercury       15.625000
jeep          15.562500
dodge         15.540541
lincoln       14.166667
land rover    14.000000
Name: average_mileage, dtype: float64

In [89]:
#return just the manufacturer with best average mileage
mpg.groupby('manufacturer').average_mileage.agg(['mean']).nlargest(columns='mean', n=1, keep='all')

              mean
manufacturer
honda         28.5

In [16]:
#or
mpg.groupby('manufacturer').average_mileage.mean().nlargest(n=1, keep='all')

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [69]:
#16 - Do automatic or manual cars have better miles per gallon?
mpg.groupby('is_automatic').average_mileage.agg(['mean'])
#manual cars have better miles per gallon

                   mean
is_automatic
automatic     19.130573
manual        22.227273

Exercises 3

In [71]:
#1 - Use your get_db_url function to help you explore the data from the chipotle database.
from env import host, username, password

get_db_url = f'mysql+pymysql://{username}:{password}@{host}/chipotle'

In [72]:
orders = pd.read_sql('SELECT * FROM orders;', get_db_url)

In [73]:
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [81]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
 6   quan_price          4622 non-null   object
dtypes: int64(3), object(4)
memory usage: 252.9+ KB

In [93]:
#2 - What is the total price for each order?
#remove the '$' and change to a float for the item_price
orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)

/var/folders/n7/fjb2f8gd5jg17xlxz1c85vhc0000gn/T/ipykernel_40653/1778853868.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)

In [95]:
#make a new column for the total for that line (quantity * item price)
orders['quan_price'] = orders.quantity * orders.item_price

In [96]:
#verify column changes
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price,quan_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39,2.39
1,2,1,1,Izze,[Clementine],3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98,33.96

In [98]:
#group by the order id and sum the order items
orders.groupby('order_id').item_price.agg(['sum'])

            sum
order_id
1         11.56
2         16.98
3         12.67
4         21.00
5         13.70
...         ...
1830      23.00
1831      12.90
1832      13.20
1833      23.50
1834      28.75

[1834 rows x 1 columns]

In [87]:
#3 - What are the most popular 3 items?
orders.groupby('item_name').quantity.agg('count').nlargest(n=3, keep='all')

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: quantity, dtype: int64

In [100]:
#4 - Which item has produced the most revenue?
orders.groupby('item_name').quan_price.agg(['sum']).nlargest(columns='sum', n=1, keep='all')

                  sum
item_name
Chicken Bowl  8044.63

In [101]:
##access the employees database##
get_db_url = f'mysql+pymysql://{username}:{password}@{host}/employees'
employees = pd.read_sql('SELECT * FROM employees;', get_db_url)
titles = pd.read_sql('SELECT * FROM titles;', get_db_url)

In [102]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [103]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [105]:
#5 - Join the employees and titles DataFrames together
emp_tit = employees.merge(titles, on='emp_no')

In [106]:
emp_tit.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

In [107]:
#6 - For each title, 
#find the hire date of the employee that was hired most recently with that title.
emp_tit.groupby('title').from_date.agg(['max'])

                           max
title
Assistant Engineer  2000-02-01
Engineer            2002-08-01
Manager             1996-08-30
Senior Engineer     2002-08-01
Senior Staff        2002-08-01
Staff               2000-02-01
Technique Leader    2000-02-01

In [112]:
#7 - Write the code necessary to create a cross tabulation of the number of titles by department. 
#(Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

#pull the department names and the titles from the database
sql = '''
SELECT d.dept_name, t.title
FROM departments AS d
JOIN dept_emp AS de USING(dept_no)
JOIN titles AS t USING(emp_no);'''

depts_titles = pd.read_sql(sql, get_db_url)
depts_titles

               dept_name         title
0       Customer Service         Staff
1       Customer Service  Senior Staff
2       Customer Service         Staff
3       Customer Service  Senior Staff
4       Customer Service         Staff
...                  ...           ...
489898             Sales  Senior Staff
489899             Sales         Staff
489900             Sales         Staff
489901             Sales  Senior Staff
489902             Sales         Staff

[489903 rows x 2 columns]

In [113]:
#cross tabulate the department names against the titles
pd.crosstab(depts_titles.dept_name, depts_titles.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0